app/views/topics/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 43]]
---
             <%= post.user.name %><br>
             <%= post.comments.count %> Comments