app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 12]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 21]]
---
    <p><%= markdown_to_html @post.body %></p>
    <p><%= @comments.count %> Comment(s)</p>