app/controllers/topics_controller.rb

  def index
    @topics = Topic.visible_to(current_user).paginate(page: params[:page], per_page: 10)
---
SELECT  "topics".* FROM "topics" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "topics"

  def show
    @topic = Topic.find(params[:id])
    authorize @topic
    @posts = @topic.posts.includes(:user).includes(:comments).paginate(page: params[:page], per_page: 10)
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."topic_id" = ?  ORDER BY created_at DESC LIMIT 10 OFFSET 0  [["topic_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 43]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."topic_id" = ?  [["topic_id", 15]]

  def create
    @topic = Topic.new(topic_params)
    authorize @topic
    if @topic.save
---
INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "CRUD"], ["description", "is a four letter word"], ["created_at", "2015-04-12 03:52:00.721397"], ["updated_at", "2015-04-12 03:52:00.721397"]]

  def destroy
    @topic = Topic.find(params[:id])
    authorize @topic
    if @topic.destroy
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]