app/controllers/votes_controller.rb

  def up_vote
    @post = Post.find(params[:post_id])

    @vote = @post.votes.where(user_id: current_user.id).first

    if @vote
      @vote.update_attribute(:value, 1)
    else
      @vote = current_user.votes.create(value: 1, post: @post)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 31]]
SELECT  "votes".* FROM "votes" WHERE "votes"."post_id" = ? AND "votes"."user_id" = ?  ORDER BY "votes"."id" ASC LIMIT 1  [["post_id", 31], ["user_id", 8]]
UPDATE "posts" SET "rank" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["rank", 16491.026083245823], ["updated_at", "2015-05-15 04:06:43.086988"], ["id", 15]]
UPDATE "votes" SET "value" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["value", 1], ["updated_at", "2015-05-15 01:42:45.121816"], ["id", 3]]
INSERT INTO "votes" ("value", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["value", 1], ["post_id", 31], ["user_id", 8], ["created_at", "2015-05-15 01:41:18.429708"], ["updated_at", "2015-05-15 01:41:18.429708"]]

  def load_post_and_vote
    @post = Post.find(params[:post_id])
    @vote = @post.votes.where(user_id: current_user.id).first
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 31]]
SELECT  "votes".* FROM "votes" WHERE "votes"."post_id" = ? AND "votes"."user_id" = ?  ORDER BY "votes"."id" ASC LIMIT 1  [["post_id", 31], ["user_id", 8]]